Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh11-v3.tmx
Source language: bo
Languages: en

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་པ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་འཚལ་བས། རྟག་ཏུ་སྒྱུ་མའི་སྐྱེས་བུ་ལྟར་བསླབ་པར་བགྱི་ལགས་སོ། །
en: Great bodhisattva beings who practice the transcendent perfection of wisdom accordingly, and seek emancipation in unsurpassed completely perfect enlightenment, should always train in the manner of an illusory person.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཙུན་པ་བཅོམ་ལྡན་འདས་འདི་ལྟར་འདི་ལྟ་སྟེ། ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་པོ་དག །སྒྱུ་མའི་སྐྱེས་བུ་ལྟ་བུར་རིག་པར་བགྱི་བའི་སླད་དུའོ། །
en: If one were to ask why, Reverend Lord, it is so that the five acquisitive psycho-physical aggregates might be understood to resemble an illusory person.”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། འོ་ན་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་པོ་འདི་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབས་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ངེས་པར་འབྱུང་བར་འགྱུར་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that these five acquisitive psycho-physical aggregates can train in the transcendent perfection of wisdom and attain emancipation in omniscience?”

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: he replied.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་འདི་ལྟར་ཕུང་པོ་ལྔ་པོ་དག་ནི་དངོས་པོ་མ་མཆིས་པའི་ངོ་བོ་ཉིད་ལགས་ལ། དངོས་པོ་མ་མཆིས་པའི་ངོ་བོ་ཉིད་དེ་ཡང་དམིགས་སུ་མ་མཆིས་པའི་སླད་དུའོ། །
en: “And if one were to ask why, Reverend Lord, it is because the five psycho-physical aggregates have an essential nature of non-entity, and the essential nature of non-entity is non-apprehensible.”

source: བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། རྨི་ལམ་ལྟ་བུའི་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་པོ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབས་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ངེས་པར་འབྱུང་བར་འགྱུར་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the five psycho-physical aggregates can, in a dreamlike manner, train in the transcendent perfection of wisdom and attain emancipation in omniscience?”

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཙུན་པ་བཅོམ་ལྡན་འདས་འདི་ལྟར་རྨི་ལམ་ནི་དངོས་པོ་མ་མཆིས་པའི་ངོ་བོ་ཉིད་ལགས་ལ། དངོས་པོ་མ་མཆིས་པའི་ངོ་བོ་ཉིད་དེ་ཡང་དམིགས་སུ་མ་མཆིས་པའི་སླད་དུའོ། །བཀའ་སྩལ་པ།
en: he replied, “And if one were to ask why, Reverend Lord, it is because dreams have an essential nature of non-entity, and the essential nature of non-entity is non-apprehensible.”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། ཕུང་པོ་ལྔ་པོ་དག་བྲག་ཅ་ལྟ་བུ་ཡིན་སྙམ་འམ། དེ་བཞིན་དུ་མིག་ཡོར་ལྟ་བུ་དང་། སྨིག་རྒྱུ་ལྟ་བུ་དང་། སྤྲུལ་པ་ལྟ་བུ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the five psycho-physical aggregates can, in the manner of an echo, or similarly, in the manner of an optical aberration, a mirage, or a phantom, [train in the transcendent perfection of wisdom and attain emancipation in omniscience]?”

source: གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་ལྟ་ལགས་སོ། །
en: “No, Reverend Lord!”

source: བཀའ་སྩལ་པ།
en: he replied.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། ཅི་ཕུང་པོ་ལྔ་པོ་འདི་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབས་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ངེས་པར་འབྱུང་བར་འགྱུར་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that these five psycho-physical aggregates can train in the transcendent perfection of wisdom and attain emancipation in omniscience?”

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཙུན་པ་བཅོམ་ལྡན་འདས་འདི་ལྟར་གཟུགས་ནི་སྒྱུ་མ་ལྟ་བུ་ལགས་ཤིང་། དེ་བཞིན་དུ་ཚོར་བ་དང་།
en: he replied.

source: འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ནི་སྒྱུ་མ་ལྟ་བུ་ལགས་ལ། རྣམ་པར་ཤེས་པ་གང་ལགས་པ་དེ་ནི་དབང་པོ་དྲུག་ལགས་ལ། དབང་པོ་དྲུག་གང་ལགས་པ་དེ་ནི་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་པོ་རྣམས་ལགས་པའི་སླད་དུའོ། །
en: “And if one were to ask why, Reverend Lord, it is because physical forms are like an illusion, and similarly, feelings, perceptions, formative predispositions, and consciousness are like an illusion, and because what is true of consciousness is also true of the six sense organs, and what is true of the six sense organs is also true of the five acquisitive psycho-physical aggregates.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གཟུགས་ནི་རྨི་ལམ་ལྟ་བུ་ལགས་ལ།
en: Reverend Lord!

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ནི་རྨི་ལམ་ལྟ་བུ་ལགས་ཏེ།
en: Physical forms are like a dream, and similarly, feelings, perceptions, formative predispositions, and consciousness are like a dream.

source: རྣམ་པར་ཤེས་པ་གང་ལགས་པ་དེ་ནི་དབང་པོ་དྲུག་ལགས་ལ། དབང་པོ་དྲུག་གང་ལགས་པ་དེ་ནི་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་པོ་དག་ལགས་ཏེ།
en: What is true of consciousness is true of the six sense organs, and what is true of the six sense organs is true of the five acquisitive psycho-physical aggregates.

source: དེ་དག་ཀྱང་ནང་སྟོང་པ་ཉིད་ལ་མི་དམིགས། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་ཡང་མི་དམིགས་ལགས་སོ། །
en: These do not apprehend the emptiness of internal phenomena, nor do they apprehend the other aspects of emptiness, up to and including the emptiness of the essential nature of non-entities.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་འོ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པས།
en: “Reverend Lord!

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ་འདི་ཐོས་ན་སྐྲག་ཅིང་དངང་ལ། དངང་བར་མི་འགྱུར་ལགས་སམ། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: In that case, will the bodhisattvas who have newly embarked upon the [Great] Vehicle not be afraid and terrified when they hear this teaching on the transcendent perfection of wisdom?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤ་ར་དྭ་ཏིའི་བུ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐེག་པ་ལ་གསར་དུ་ཡང་དག་པར་ཞུགས་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཐབས་ལ་མཁས་པ་ཡང་མ་ཡིན། དགེ་བའི་བཤེས་གཉེན་གྱི་ལག་ཏུ་སོང་བ་ཡང་མ་ཡིན་ནོ།སྐྲག་ཅིང་དངང་ལ་དངང་བར་འགྱུར་རོ། །
en: The Blessed One then addressed the venerable Śāradvatī­putra as follows: “Śāradvatī­putra, great bodhisattva beings who newly embark on the [Great] Vehicle will be afraid and terrified if they are unskilled in the transcendent perfection of wisdom and they are not taken in hand by an excellent spiritual mentor.”

source: གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ། གང་ལ་སྤྱོད་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ་འདི་ཐོས་ནས། མི་སྐྲག་མི་དངང་ཞིང་དངང་བར་མི་འགྱུར་བའི་ཐབས་ལ་མཁས་པ་གང་ལགས།
en: “Reverend Lord, when great bodhisattva beings practice the transcendent perfection of wisdom, what is the skill in means that enables great bodhisattva beings who have heard this teaching on the transcendent perfection of wisdom not to be afraid and not to be terrified?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་ཀྱིས་གཟུགས་མི་རྟག་ཅེས་བྱ་བའི་རྣམ་པར་སོ་སོར་རྟོག་སྟེ། དེ་ཡང་མི་དམིགས་ལ།
en: The Blessed One replied, “Śāradvatī­putra, when great bodhisattva beings practice the transcendent perfection of wisdom, they discern through their minds endowed with omniscience that physical forms are impermanent, and do not focus on them.

source: དེ་བཞིན་དུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་ཀྱིས་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་མི་རྟག་ཅེས་བྱ་བའི་རྣམ་པར་སོ་སོར་རྟོག་ཅིང་དེ་ཡང་མི་དམིགས་ཏེ།
en: Similarly, they discern through their minds endowed with omniscience that feelings, perceptions, formative predispositions, and consciousness are impermanent, and do not focus on them.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཐབས་ལ་མཁས་པ་ཡིན་ནོ། །
en: This, Śāradvatī­putra, is the skill in means through which great bodhisattva beings practice the transcendent perfection of wisdom.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་ཀྱིས་གཟུགས་སྡུག་བསྔལ་བའི་རྣམ་པར་སོ་སོར་རྟོག་སྟེ།
en: “Moreover, Śāradvatī­putra, when great bodhisattva beings practice the transcendent perfection of wisdom, they discern through their minds endowed with omniscience that physical forms are imbued with suffering, and do not focus on them.

source: དེ་ཡང་མི་དམིགས་དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་སྡུག་བསྔལ་བའི་རྣམ་པར་སོ་སོར་རྟོག་སྟེ།
en: Similarly, they discern that feelings, perceptions, formative predispositions, and consciousness are imbued with suffering, and do not focus on them.

source: དེ་ཡང་མི་དམིགས་དེ་བཞིན་དུ་སྦྱར་ཏེ། གཟུགས་བདག་མེད་པའི་རྣམ་པར་སོ་སོར་རྟོག་སྟེ། དེ་ཡང་མི་དམིགས།
en: In the same vein, they discern that physical forms are not a self, and do not focus on them.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་བདག་མེད་པའི་རྣམ་པར་སོ་སོར་རྟོག་སྟེ། དེ་ཡང་མི་དམིགས།
en: Similarly, they discern that feelings, perceptions, formative predispositions, and consciousness are not a self, and do not focus on them.

source: གཟུགས་སྟོང་པའི་རྣམ་པར་སོ་སོར་རྟོག་སྟེ། དེ་ཡང་མི་དམིགས།
en: They discern that physical forms are empty, and do not focus on them.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་སྟོང་པའི་རྣམ་པར་སོ་སོར་རྟོག་སྟེ། དེ་ཡང་མི་དམིགས།
en: Similarly, they discern that feelings, perceptions, formative predispositions, and consciousness are empty, and do not focus on them.

source: གཟུགས་མཚན་མ་མེད་པའི་རྣམ་པར་སོ་སོར་རྟོག་སྟེ། དེ་ཡང་མི་དམིགས།
en: They discern that physical forms are signless, and do not focus on them.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་མཚན་མ་མེད་པའི་རྣམ་པར་སོ་སོར་རྟོག་སྟེ། དེ་ཡང་མི་དམིགས།
en: Similarly, they discern that feelings, perceptions, formative predispositions, and consciousness are signless, and do not focus on them.

source: གཟུགས་སྨོན་པ་མེད་པའི་རྣམ་པར་སོ་སོར་རྟོག་སྟེ། དེ་ཡང་མི་དམིགས།
en: They discern that physical forms are without aspirations, and do not focus on them.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་སྨོན་པ་མེད་པའི་རྣམ་པར་སོ་སོར་རྟོག་སྟེ། དེ་ཡང་མི་དམིགས།
en: Similarly, they discern that feelings, perceptions, formative predispositions, and consciousness are without aspirations, and do not focus on them.

source: གཟུགས་ཞི་བའི་རྣམ་པར་སོ་སོར་རྟོག་སྟེ། དེ་ཡང་མི་དམིགས།
en: They discern that physical forms are calm, and do not focus on them.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ཞི་བའི་རྣམ་པར་སོ་སོར་རྟོག་སྟེ། དེ་ཡང་མི་དམིགས།
en: Similarly, they discern that feelings, perceptions, formative predispositions, and consciousness are calm, and do not focus on them.

source: གཟུགས་དབེན་པའི་རྣམ་པར་སོ་སོར་རྟོག་སྟེ། དེ་ཡང་མི་དམིགས།
en: They discern that physical forms are void, and do not focus on them.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་དབེན་པའི་རྣམ་པར་སོ་སོར་རྟོག་སྟེ། དེ་ཡང་མི་དམིགས།
en: Similarly, they discern that feelings, perceptions, formative predispositions, and consciousness are void, and do not focus on them.

source: གཟུགས་རྣམ་པར་བྱང་བའི་རྣམ་པར་སོ་སོར་རྟོག་སྟེ། དེ་ཡང་མི་དམིགས།
en: They discern that physical forms are pure, and do not focus on them.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་རྣམ་པར་བྱང་བའི་རྣམ་པར་སོ་སོར་རྟོག་སྟེ། དེ་ཡང་མི་དམིགས།
en: Similarly, they discern that feelings, perceptions, formative predispositions, and consciousness are pure, and do not focus on them.

source: གཟུགས་སྐྱེ་བ་མེད་པའི་རྣམ་པར་སོ་སོར་རྟོག་སྟེ། དེ་ཡང་མི་དམིགས།
en: They discern that physical forms are non-arising, and do not focus on them.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་སྐྱེ་བ་མེད་པའི་རྣམ་པར་སོ་སོར་རྟོག་སྟེ། དེ་ཡང་མི་དམིགས།
en: Similarly, they discern that feelings, perceptions, formative predispositions, and consciousness are non-arising, and do not focus on them.

source: གཟུགས་འགག་པ་མེད་པའི་རྣམ་པར་སོ་སོར་རྟོག་སྟེ། དེ་ཡང་མི་དམིགས།
en: They discern that physical forms are unceasing, and do not focus on them.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་འགག་པ་མེད་པའི་རྣམ་པར་སོ་སོར་རྟོག་སྟེ། དེ་ཡང་མི་དམིགས།
en: Similarly, they discern that feelings, perceptions, formative predispositions, and consciousness are unceasing, and do not focus on them.

source: གཟུགས་དངོས་པོ་མེད་པའི་རྣམ་པར་སོ་སོར་རྟོག་སྟེ། དེ་ཡང་མི་དམིགས།
en: They discern that physical forms are non-entities, and do not focus on them.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་དངོས་པོ་མེད་པའི་རྣམ་པར་སོ་སོར་རྟོག་སྟེ། དེ་ཡང་མི་དམིགས་པ་སྟེ།
en: Similarly, they discern that feelings, perceptions, formative predispositions, and consciousness are non-entities, and do not focus on them.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཐབས་ལ་མཁས་པ་ཡིན་ནོ། །
en: This, Śāradvatī­putra, is the skillful means through which great bodhisattva beings practice the transcendent perfection of wisdom.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དེ་ལྟར་སོ་སོར་རྟོག་ཅིང་། གང་གི་ཚེ་སེམས་ཅན་ཐམས་ཅད་ལ་གཟུགས་དང་། དེ་བཞིན་དུ་རྣམ་པར་ཤེས་པའི་བར་དུ་མི་རྟག་ཅེས་བྱ་བར་ཆོས་སྟོན་ཅིང་། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་།
en: “Śāradvatī­putra, when great bodhisattva beings discern this, without apprehending anything, they teach all sentient beings the sacred doctrine that physical forms, and likewise [all the aggregates] up to and including consciousness, are impermanent.

source: གཟུགས་དང་དེ་བཞིན་དུ་རྣམ་པར་ཤེས་པའི་བར་དུ་སྡུག་བསྔལ་ཞེས་བྱ་བར་ཆོས་སྟོན་ཅིང་། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་།
en: Without apprehending anything, they teach the sacred doctrine that physical forms, and likewise [all the aggregates] up to and including consciousness, are imbued with suffering.

source: གཟུགས་དང་དེ་བཞིན་དུ་རྣམ་པར་ཤེས་པའི་བར་དུ་བདག་མེད་ཅེས་བྱ་བར་ཆོས་སྟོན་ཅིང་། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་།
en: Without apprehending anything, they teach the sacred doctrine that physical forms, and likewise [all the aggregates] up to and including consciousness, are not a self.

source: གཟུགས་དང་། དེ་བཞིན་དུ་རྣམ་པར་ཤེས་པའི་བར་དུ་སྟོང་ཞེས་བྱ་བར་ཆོས་སྟོན་ཅིང་། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་།
en: Without apprehending anything, they teach the sacred doctrine that physical forms, and likewise [all the aggregates] up to and including consciousness, are empty.

source: གཟུགས་དང་། དེ་བཞིན་དུ་རྣམ་པར་ཤེས་པའི་བར་དུ་མཚན་མ་མེད་ཅེས་བྱ་བར་ཆོས་སྟོན་ཅིང་། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་།
en: Without apprehending anything, they teach the sacred doctrine that physical forms, and likewise [all the aggregates] up to and including consciousness, are signless.

source: གཟུགས་དང་། དེ་བཞིན་དུ་རྣམ་པར་ཤེས་པའི་བར་དུ་སྨོན་པ་མེད་ཅེས་བྱ་བར་ཆོས་སྟོན་ཅིང་། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་།
en: Without apprehending anything, they teach the sacred doctrine that physical forms, and likewise [all the aggregates] up to and including consciousness, are without aspirations.

source: གཟུགས་དང་། དེ་བཞིན་དུ་རྣམ་པར་ཤེས་པའི་བར་དུ་ཞི་ཞེས་བྱ་བར་ཆོས་སྟོན་ཅིང་། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་།
en: Without apprehending anything, they teach the sacred doctrine that physical forms, and likewise [all the aggregates] up to and including consciousness, are calm.

source: གཟུགས་དང་། དེ་བཞིན་དུ་རྣམ་པར་ཤེས་པའི་བར་དུ་དབེན་ཞེས་བྱ་བར་ཆོས་སྟོན་ཅིང་། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་།
en: Without apprehending anything, they teach the sacred doctrine that physical forms, and likewise [all the aggregates] up to and including consciousness, are void.

source: གཟུགས་དང་། དེ་བཞིན་དུ་རྣམ་པར་ཤེས་པའི་བར་དུ་སྐྱེ་བ་མེད་ཅེས་བྱ་བར་ཆོས་སྟོན་ཅིང་། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་།
en: Without apprehending anything, they teach the sacred doctrine that physical forms, and likewise [all the aggregates] up to and including consciousness, are non-arising.

source: གཟུགས་དང་། དེ་བཞིན་དུ་རྣམ་པར་ཤེས་པའི་བར་དུ་འགག་པ་མེད་ཅེས་བྱ་བར་ཆོས་སྟོན་ཅིང་། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་།
en: Without apprehending anything, they teach the sacred doctrine that physical forms, and likewise [all the aggregates] up to and including consciousness, are unceasing.

source: གཟུགས་དང་། དེ་བཞིན་དུ་རྣམ་པར་ཤེས་པའི་བར་དུ་དངོས་པོ་མེད་ཅེས་བྱ་བར་ཆོས་སྟོན་ཅིང་། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དེ་ནི།
en: Without apprehending anything, they teach the sacred doctrine that physical forms, and likewise [all the aggregates] up to and including consciousness, are non-entities.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: This, Śāradvatī­putra, is the transcendent perfection of generosity, possessed by great bodhisattva beings when they practice the transcendent perfection of wisdom.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ནི། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱེད་པ་དག་གིས་གཟུགས་དང་། དེ་བཞིན་དུ་རྣམ་པར་ཤེས་པའི་བར་དུ་མི་རྟག་ཅེས་བྱ་བར་ཡིད་ལ་མི་བྱེད་དེ། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སོ། །
en: “Moreover, Śāradvatī­putra, when great bodhisattva beings practice the transcendent perfection of wisdom, they do not pay attention with the twofold, [over-scrupulous] attentiveness of the śrāvakas and pratyekabuddhas to the notion that physical forms, and likewise [all the aggregates] up to and including consciousness, are impermanent, but they do so without apprehending anything.

source: གཟུགས་དང་། དེ་བཞིན་དུ་རྣམ་པར་ཤེས་པའི་བར་དུ་སྡུག་བསྔལ་ཞེས་བྱ་བར་ཡིད་ལ་མི་བྱེད་དེ། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ། ཉན་ཐོས་དང་།
en: They do not pay attention with the twofold, [over-scrupulous] attentiveness of the śrāvakas and pratyekabuddhas to the notion that physical forms, and likewise [all the aggregates] up to and including consciousness, are imbued with suffering, but they do so without apprehending anything.

source: རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱེད་པ་དག་གིས་གཟུགས་བདག་མེད་ཅེས་བྱ་བ་དང་། སྟོང་ཞེས་བྱ་བ་དང་། མཚན་མ་མེད་ཅེས་བྱ་བ་དང་། སྨོན་པ་མེད་ཅེས་བྱ་བ་དང་། ཞི་ཞེས་བྱ་བ་དང་། དབེན་ཞེས་བྱ་བ་དང་། རྣམ་པར་བྱང་ཞེས་བྱ་བ་དང་། སྐྱེ་བ་མེད་ཅེས་བྱ་བ་དང་། འགག་པ་མེད་ཅེས་བྱ་བ་དང་། དངོས་པོ་མེད་ཅེས་བྱ་བའི་བར་དུ་ཡིད་ལ་མི་བྱེད་དེ། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སོ། །དེ་བཞིན་དུ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཡིད་ལ་བྱེད་པ་དང་ལྡན་པ་དག་གིས་ཚོར་བ་དང་།
en: In the same vein, they do not pay attention with the twofold, [over-scrupulous] attentiveness of the śrāvakas and pratyekabuddhas to the notions that physical forms are not a self, that they are empty, that they are signless, that they are without aspirations, that they are calm, that they are void, that they are purified, that they are non-arising, that they are unceasing, and that they are non-entities, but they do so without apprehending anything.

source: འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་བདག་མེད་ཅེས་བྱ་བ་དང་། སྟོང་ཞེས་བྱ་བ་དང་། མཚན་མ་མེད་ཅེས་བྱ་བ་དང་། སྨོན་པ་མེད་ཅེས་བྱ་བ་དང་། ཞི་ཞེས་བྱ་བ་དང་། དབེན་ཞེས་བྱ་བ་དང་། རྣམ་པར་བྱང་ཞེས་བྱ་བ་དང་། སྐྱེ་བ་མེད་ཅེས་བྱ་བ་དང་།
en: Similarly, they do not pay attention with the twofold, [over-scrupulous] attentiveness of the śrāvakas and pratyekabuddhas to the notions that feelings, perceptions, formative predispositions, and consciousness are not a self, that they are empty, that they are signless, that they are without aspirations, that they are void, that they are purified, that they are non-arising, that they are unceasing, and that they are non-entities, but they do so without apprehending anything.

source: འགག་པ་མེད་ཅེས་བྱ་བ་དང་། དངོས་པོ་མེད་ཅེས་བྱ་བར་ཡིད་ལ་མི་བྱེད་ཅིང་། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་ཏེ། ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་མཆོག་ཏུ་འཛིན་པ་མེད་པ་ཡིན་ནོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ། གཟུགས་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་།
en: This, Śāradvatī­putra, is the absence of dogmatic assumptions with regard to the transcendent perfection of ethical discipline of great bodhisattva beings when they practice the transcendent perfection of wisdom.

source: རྣམ་པར་ཤེས་པ་མི་རྟག་པའི་རྣམ་པ་དང་། སྡུག་བསྔལ་བའི་རྣམ་པ་དང་། བདག་མེད་པའི་རྣམ་པ་དང་། སྟོང་པའི་རྣམ་པ་དང་། མཚན་མ་མེད་པའི་རྣམ་པ་དང་། སྨོན་པ་མེད་པའི་རྣམ་པ་དང་། ཞི་བའི་རྣམ་པ་དང་། དབེན་པའི་རྣམ་པ་དང་། རྣམ་པར་བྱང་བའི་རྣམ་པ་དང་།
en: “Moreover, Śāradvatī­putra, when great bodhisattva beings practice the transcendent perfection of wisdom, they discern that physical forms, feelings, perceptions, formative predispositions, and consciousness, are impermanent, imbued with suffering, without a self, empty, signless, lacking aspirations, calm, void, purified, non-arising, unceasing, and non-entities.

source: སྐྱེ་བ་མེད་པའི་རྣམ་པ་དང་། འགག་པ་མེད་པའི་རྣམ་པ་དང་། དངོས་པོ་མེད་པའི་རྣམ་པར་སོ་སོར་རྟོག་ཅིང་བཟོད་ལ་འདོད་པ་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་མི་འཁྲུག་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིན་ནོ། །
en: Their inclination to accept these insights is the transcendent perfection of unagitated tolerance of great bodhisattva beings when they practice the transcendent perfection of wisdom.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ནི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱེད་པ་དག་གིས་གཟུགས་ལ་མི་རྟག་པའི་རྣམ་པར་སོ་སོར་རྟོག་སྟེ། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སོ། །
en: “Moreover, Śāradvatī­putra, when great bodhisattva beings practice the transcendent perfection of wisdom, they discern through their attention endowed with omniscience that physical forms are impermanent, and they do so without apprehending anything.

source: དེ་བཞིན་དུ་སྡུག་བསྔལ་བའི་རྣམ་པ་དང་། བདག་མེད་པའི་རྣམ་པ་དང་། སྟོང་པའི་རྣམ་པ་དང་། མཚན་མ་མེད་པའི་རྣམ་པ་དང་། སྨོན་པ་མེད་པའི་རྣམ་པ་དང་། ཞི་བའི་རྣམ་པ་དང་། དབེན་པའི་རྣམ་པ་དང་། རྣམ་པར་བྱང་བའི་རྣམ་པ་དང་། སྐྱེ་བ་མེད་པའི་རྣམ་པ་དང་། འགག་པ་མེད་པའི་རྣམ་པ་དང་། དངོས་པོ་མེད་པའི་རྣམ་པར་སོ་སོར་རྟོག་སྟེ། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སོ། །དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་།
en: Similarly, they discern that [physical forms] are imbued with suffering, not a self, empty, signless, lacking aspirations, calm, void, purified, non-arising, unceasing, and non-entities, and they do so without apprehending anything.

source: རྣམ་པར་ཤེས་པ་ལ་མི་རྟག་པའི་རྣམ་པ་དང་། སྡུག་བསྔལ་བའི་རྣམ་པ་དང་། བདག་མེད་པའི་རྣམ་པ་དང་། སྟོང་པའི་རྣམ་པ་དང་། མཚན་མ་མེད་པའི་རྣམ་པ་དང་། སྨོན་པ་མེད་པའི་རྣམ་པ་དང་། ཞི་བའི་རྣམ་པ་དང་། དབེན་པའི་རྣམ་པ་དང་། རྣམ་པར་བྱང་བའི་རྣམ་པ་དང་། སྐྱེ་བ་མེད་པའི་རྣམ་པ་དང་།
en: Likewise, they discern that feelings, perceptions, formative predispositions, and consciousness are impermanent, imbued with suffering, not a self, empty, signless, lacking aspirations, calm, void, purified, non-arising, unceasing, and non-entities, and they do so without apprehending anything.

source: འགག་པ་མེད་པའི་རྣམ་པ་དང་། དངོས་པོ་མེད་པའི་རྣམ་པར་སོ་སོར་རྟོག་སྟེ། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་རྟོག་ལ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱེད་པའི་བརྩོན་པ་མི་འདོར་བ་གང་ཡིན་པ་དེ་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱའོ། །
en: The non-forsaking of perseverance with regard to this attention endowed with omniscience is called the transcendent perfection of perseverance of great bodhisattva beings when they practice the transcendent perfection of wisdom.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གཟུགས་ལ་མི་རྟག་པའི་རྣམ་པར་སོ་སོར་རྟོག་སྟེ། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སོ། །
en: “Moreover, Śāradvatī­putra, when great bodhisattva beings practice the transcendent perfection of wisdom, they discern that physical forms are impermanent, and they do so without apprehending anything.
